AneekMubarak/MobileToolAssistant/DWM1000_tests/stm32/final/robot_end_rtos/Core/Src/dwm1000.c
	//2.AGC Tune2 (4 oct)
	uint8_t new_agc2_config[4] = {0x07,0xa9,0x02,0x25};
	dwm_write_reg_sub(module, 0x23,0x0c,new_agc2_config,4);

	//	//3. DRX_Tune_2 (4 oct)
	uint8_t new_drx2_config[4] = {0x2d,0x00,0x1a,0x31}; // PAC 8, 16Mhz
//    uint8_t new_drx2_config[4] = {0x9a,0x00,0x1a,0x35}; // PAC 32, 16Mhz
//    0x31 3B 00 6B
    // for PAC 8 -> 64Mhz Prf
//    uint8_t new_drx2_config[4] = {0x6b,0x00,0x3b,0x31};


	dwm_write_reg_sub(module, 0x27,0x08,new_drx2_config,4);

	//4. NTM
	uint8_t lde_cfg_1[1] = {0};
	dwm_read_reg_sub(module, 0x2E,0x0806,lde_cfg_1,1);
	lde_cfg_1[0] = (lde_cfg_1[0] & ~0x1F) | (0x0D & 0x1F);
	dwm_write_reg_sub(module, 0x2E,0x0806,lde_cfg_1,1);

//	5.LDE Config 2
	uint8_t lde_cfg_2[2] = {0x07,0x16};
	dwm_write_reg_sub(module, 0x2E,0x1806,lde_cfg_2,2);

//	//6. Tx Power
	uint8_t tx_power_ctrl[4] ={0x48,0x28,0x08,0x0e};
	dwm_write_reg_sub(module, 0x1E,0x00,tx_power_ctrl,4);


//	7. RF_TXCTRL (3 oct)
//	 DATASHEET_UNCLEAR (refer pg 153)
//	 The data sheet says set 24 bits,  last oct is reserved and set to 0x00 but when reading it has 0xde, might have to set to 0x00 of issues
	uint8_t rf_txctrl[3] = {0xe3,0x3f,0x1e};
	dwm_write_reg_sub(module, 0x28,0x0c,rf_txctrl,3);

//	8.TC_PGDELAY (1 oct)
	uint8_t tc_pgdelay[1] = {0xc0};
	dwm_write_reg_sub(module, 0x2A,0x0b,tc_pgdelay,1);

//	9.PLL_TUNE (1 oct)
	uint8_t fs_pll_tune[1] = {0xbe};
	dwm_write_reg_sub(module, 0x2b,0x0b,fs_pll_tune,1);


//	10. LDE_LOAD
	//NOTE: refer page 176 for ldeload instruction if waking up from sleep/deep sleep

	//L1 - write to PMSC Control0 lower 16 bits
	uint8_t pmsc_ctrl_0_lower_2_oct[2] = {0x01,0x03};
	dwm_write_reg_sub(module, 0x36, 0x00, pmsc_ctrl_0_lower_2_oct, 2);

	//L2 - set OTP control LDELOAD bit (write entire reg)
	uint8_t otp_control[2] = {0x00,0x80};
	dwm_write_reg_sub(module, 0x2d, 0x06, otp_control, 2);

	//Wait 150us
//	HAL_Delay(1);
    osDelay(1);


	// L-3
	uint8_t pmsc_ctrl_0_lower_2_oct_L3[2] = {0x00,0x02};
	dwm_write_reg_sub(module, 0x36, 0x00, pmsc_ctrl_0_lower_2_oct_L3, 2);


	// 10.LDO TUNE
		//NOTE: can be skipped ig

	// ADDDITIONAL - (not part of the recommended configs)

	//To fix the CLKPLL_LL bit not locking issue in reg 0x0f, the PLLDT bit of 0x24 must be set

	  uint8_t ec_ctrl_reg[4] = {0};
	  dwm_read_reg_sub(module, 0x24,0x00,ec_ctrl_reg,4);
	  ec_ctrl_reg[0] = ec_ctrl_reg[0]|0x04;
	  dwm_write_reg_sub(module, 0x24,0x00,ec_ctrl_reg,4);


	  // NEW
//	  // set RX PRF to 64Mhz
//	  uint8_t chan_ctrl_reg[4];
//	  chan_ctrl_reg[2] = chan_ctrl_reg[2]&0xF3;
//	  chan_ctrl_reg[2] |= 0x08; // set to 0x04 for 16Mhz
//	  dwm_write_reg(module,0x1f,chan_ctrl_reg,4)

	  // Antenna Delay
//	  uint16_t ant_delay = 16456;
}


//void dwm_configure(DWM_Module* module){
//
//	//1. AGC Tune1 - 2 octets
//	uint8_t current_agc1_config[2] = {0};
//	dwm_read_reg_sub(module,0x23,0x04,current_agc1_config,2);
//
//	current_agc1_config[0] = 0x70;
//	current_agc1_config[1] = 0x88;
//
//	dwm_write_reg_sub(module, 0x23,0x04,current_agc1_config,2);
//	// dwm_read_reg_sub(module, 0x23,0x04,current_agc1_config,2);
//
//
//	//2.AGC Tune2 (4 oct)
//	uint8_t new_agc2_config[4] = {0x07,0xa9,0x02,0x25};
//	dwm_write_reg_sub(module, 0x23,0x0c,new_agc2_config,4);
//
//    // AGC Tune3
//    uint8_t agc_tune3[2] = {0x55, 0x00};
//    dwm_write_reg_sub(module, 0x23, 0x12, agc_tune3, 2);
//
//    // DRX_Tune 0b
//    uint8_t drx_tune0b[2] = {0x06, 0x00}; // non-SFD, good performance apparently, must check
//    dwm_write_reg_sub(module, 0x27, 0x02, drx_tune0b, 2);
//
//    // DRX_Tune 1a
//    uint8_t drx_tune1a[2] = {0x87, 0x00}; //this is for 16Mhz
//    dwm_write_reg_sub(module, 0x27, 0x04, drx_tune1a, 2);
//
//    // DRX_Tune 1b
//    uint8_t drx_tune1b[2] = {0x20, 0x00}; //this is for 850 kbps
//    dwm_write_reg_sub(module, 0x27, 0x06, drx_tune1b, 2);
//
//		//3. DRX_Tune_2 (4 oct)
//    uint8_t new_drx2_config[4] = {0x9a,0x00,0x1a,0x35};
//	dwm_write_reg_sub(module, 0x27,0x08,new_drx2_config,4);
//
//
//	//4. NTM
//	uint8_t lde_cfg_1[1] = {0};
//	dwm_read_reg_sub(module, 0x2E,0x0806,lde_cfg_1,1);
//	lde_cfg_1[0] = (lde_cfg_1[0] & ~0x1F) | (0x0D & 0x1F);
//	dwm_write_reg_sub(module, 0x2E,0x0806,lde_cfg_1,1);
//
////	5.LDE Config 2
//	uint8_t lde_cfg_2[2] = {0x07,0x16};
//	dwm_write_reg_sub(module, 0x2E,0x1806,lde_cfg_2,2);
//
//	//6. Tx Power
//	uint8_t tx_power_ctrl[4] ={0x48,0x28,0x08,0x0e};
//	dwm_write_reg_sub(module, 0x1E,0x00,tx_power_ctrl,4);
//
//
////	7. RF_TXCTRL (3 oct)
////	 DATASHEET_UNCLEAR (refer pg 153)
////	 The data sheet says set 24 bits,  last oct is reserved and set to 0x00 but when reading it has 0xde, might have to set to 0x00 of issues
//	uint8_t rf_txctrl[3] = {0xe3,0x3f,0x1e};
//	dwm_write_reg_sub(module, 0x28,0x0c,rf_txctrl,3);
//
////	8.TC_PGDELAY (1 oct)
//	uint8_t tc_pgdelay[1] = {0xc0};
//	dwm_write_reg_sub(module, 0x2A,0x0b,tc_pgdelay,1);
//
////	9.PLL_TUNE (1 oct)
//	uint8_t fs_pll_tune[1] = {0xbe};
//	dwm_write_reg_sub(module, 0x2b,0x0b,fs_pll_tune,1);
//
//    // TX_FCTRL config - we set PRF, bit rate, and length of preamble over here
//    uint8_t tx_fctrl[5] = {0};
//    dwm_read_reg(module, 0x08, tx_fctrl, 5);
//
//    tx_fctrl[1] = (tx_fctrl[1] & 0x9F) | (0x20); //setting bit rate here to 850 kbps, was 6.8 Mbps before
//    tx_fctrl[2] = (tx_fctrl[2] & 0xC0) | (0x09); //setting PRF to 16 Mhz
//
//    // SET PSR to 10
//    tx_fctrl[2] = (tx_fctrl[2] & 0xc3) | (0x08); // 1024 preamble length
//
//    dwm_write_reg(module, 0x08, tx_fctrl, 5);
//
//
////	10. LDE_LOAD
//	//NOTE: refer page 176 for ldeload instruction if waking up from sleep/deep sleep
//
//	//L1 - write to PMSC Control0 lower 16 bits
//	uint8_t pmsc_ctrl_0_lower_2_oct[2] = {0x01,0x03};
//	dwm_write_reg_sub(module, 0x36, 0x00, pmsc_ctrl_0_lower_2_oct, 2);
//
//	//L2 - set OTP control LDELOAD bit (write entire reg)
//	uint8_t otp_control[2] = {0x00,0x80};
//	dwm_write_reg_sub(module, 0x2d, 0x06, otp_control, 2);
//
//	//Wait 150us
//	osDelay(5);
//
//	// L-3
//	uint8_t pmsc_ctrl_0_lower_2_oct_L3[2] = {0x00,0x02};
//	dwm_write_reg_sub(module, 0x36, 0x00, pmsc_ctrl_0_lower_2_oct_L3, 2);
//
//
//	// 10.LDO TUNE
//		//NOTE: can be skipped ig
//
//	// ADDDITIONAL - (not part of the recommended configs)
//
//	//To fix the CLKPLL_LL bit not locking issue in reg 0x0f, the PLLDT bit of 0x24 must be set
//
//	  uint8_t ec_ctrl_reg[4] = {0};
//	  dwm_read_reg_sub(module, 0x24,0x00,ec_ctrl_reg,4);
//	  ec_ctrl_reg[0] = ec_ctrl_reg[0]|0x04;
//	  dwm_write_reg_sub(module, 0x24,0x00,ec_ctrl_reg,4);
//
//	  osDelay(10);
//
//}


void dwm_basic_transmit(DWM_Module* module){
	/*
	 * 1. Write data in TX_BUFFER
	 * 2. Set frame len + other details in TX_FCTRL
	 * 3. Initialte using TXSTRT bit in SysCtrlReg (0x0D)
	 *
	 * NOTE: Cannot read from TxBuffer
	 * WARNING: reafing TX_FCTRL also reads TX_BUFFER, so dont read it during actove tx
	 *
	 * TX_FCTRL
	 * 		-TFLEN: frame len, payload length + 2 CRC bytes
	 * 		-TFLE: extended mode - not needed
	 * 		-TXBR: bit rate, default = 6.8Mbps
	 * 		-TR: Transmit bit rate ( ig its not needed) its set to 1 by def DATASHEET_UNCLEAR
	 * 		-TXPRF: Pulse repetion freq (default of 16Mhz is ok, must be grater than 4Mhz)
	 * 		-TXPSR: preamble length
	 *
	 * 		-NOTE - Modify premable length (TXPSR = 0b10, PE = 0b00) for preamble length of 1024
	 * 		-NOTE - Receiver must match this
	 *
	 */



	// WRITE DATA TO TX BUFFER
	uint8_t tx_data[6] ={0xAA,0xBB,0xCC,0xDD,0xEE,0xFF};
//	uint8_t tx_data[4] ={0xCA,0xAC,0x09,0xEF};
	//0xFFEEDDCCBBAA

