AneekMubarak/MobileToolAssistant/DWM1000_tests/stm32/final/robot_end_rtos/Core/Src/dwm1000.c
	dwm_write_reg(module, 0x09, tx_data, 6);

	//SET FRAME LENGTH AND PREAMBLE LENGTH
	uint8_t tx_frame_control[5] = {0};
	dwm_read_reg(module, 0x08, tx_frame_control, 5);
	// fr_len = 4 + 2 +2  =
	// Set frame length
	tx_frame_control[0] &= 0x80;
	tx_frame_control[0] |= 8;
	// Set TXPSR=10, PE=00
	tx_frame_control[2] &= ~(0x3C);
	tx_frame_control[2] |= (0b10 << 2);

    // Set bitrate to 850kbps (Comment the blwow lines for default of 6.8Mbps)
//    tx_frame_control[1] &= 0x9f; //clear
//    tx_frame_control[1] |= 0x20; //set to 850kpbs


	dwm_write_reg(module, 0x08, tx_frame_control, 5);


	//TRASMIT
	uint8_t sys_ctrl[4] = {0};
	dwm_read_reg(module, 0x0D, sys_ctrl, 4);
	sys_ctrl[0] |= (1 << 1);
	dwm_write_reg(module, 0x0D, sys_ctrl, 4);

}

/*
    buffer: buffer for message , use expected size (only payload no CRC)
    len: len of buffer array (octs)
*/
bool dwm_receive(DWM_Module* module, uint8_t* buffer, uint16_t len){

    uint8_t sys_event_status_reg[5] = {0};
    uint8_t rx_frame_info_reg[4] = {0};
    // uint8_t rx_buffer[6] = {0}; // tflen = 6 but the top2 crc bits can be ignored here
    uint8_t sys_ctrl_reg[4] = {0};

    int tflen = 0;

    int rxdfr = 0;
    int rxcfg = 0;
    int lde_done = 0;




    // ENABLE Rx
//    dwm_read_reg(module, 0x0D, sys_ctrl_reg, 4);
//    sys_ctrl_reg[1] |= (1 << 0); // RXENAB
//
//    dwm_write_reg(module, 0x0D, sys_ctrl_reg, 4);

    // now dw1000 is waiting for preamble
    // Add timeouts here ig
    int tries = 20;
    for (int i=0;i<=tries;i++){
        dwm_read_reg(module, 0x0F, sys_event_status_reg, 5);

        rxdfr = sys_event_status_reg[1]&0x20;
        rxcfg = sys_event_status_reg[1]&0x40;
        lde_done = sys_event_status_reg[1]&0x04;



        if(rxdfr && rxcfg && lde_done){ // RXDFR is high
            dwm_read_reg(module, 0x10,rx_frame_info_reg,4);
            tflen = rx_frame_info_reg[0]&0x7f; //tflen

            if(tflen != 8){
            	return false;
            }



            dwm_read_reg(module, 0x11,buffer,tflen-2); // no need CRC bits --> write data to buffer
            // PROBLEM: can corrupt mem if buff too small
            // Better to come up with a standard tflen across all DWMs and set to max.

//            dwm_write_reg(module, 0x0F, sys_event_status_reg, 5); // clear all status bits

            uint8_t clear[5] = {0};
            clear[1] = 0x20 | 0x40 | 0x04; // RXDFR | RXFCG | LDEDONE
            dwm_write_reg(module, 0x0F, clear, 5);

            return true;
        }

//        HAL_Delay(1);
        osDelay(1);

    }
    // force RX reset
    uint8_t sys_ctrl[4] = {0};
    sys_ctrl[0] |= (1 << 6); // TRXOFF
    dwm_write_reg(module, 0x0D, sys_ctrl, 4);

    // clear RX error flags only
    uint8_t clear[5] = {0};
    clear[1] = 0xF0; // RX errors
    dwm_write_reg(module, 0x0F, clear, 5);

    return false;

}



//------------------
// Two Way Ranging
//-------------------
// use 0x17 for TX_time and 0x15 for Rx_time
uint64_t read_timestamp(DWM_Module* module,uint8_t reg)
{
    uint8_t ts[5];
    dwm_read_reg_sub(module, reg, 0x00, ts, 5);

    uint64_t value = 0;
    for (int i = 4; i >= 0; i--) {
        value = (value << 8) | ts[i];
    }

    return value;
}

uint64_t ts_diff(uint64_t a, uint64_t b)
{
    //handle wraparound
    const uint64_t MASK = ((uint64_t)1 << 40) - 1;
    return (a - b) & MASK;
}



int send_frame(DWM_Module* module, uint8_t* payload, uint8_t len)
{
    // write to TX buffer
    dwm_write_reg(module, 0x09, payload, len);

    // configure TX_FCTRL
    uint8_t tx_frame_control[5] = {0};
    dwm_read_reg(module, 0x08, tx_frame_control, 5);

    tx_frame_control[0] &= 0x80;
    tx_frame_control[0] |= (len + 2); // include CRC

//    // NEW
//    // Set PRF to 64Mhz (comment out for 16Mhz)
//    tx_frame_control[1] &= 0b11001111;
//    tx_frame_control[1] |= 0b00100000;


    dwm_write_reg(module, 0x08, tx_frame_control, 5);

    // trigger TX
    uint8_t sys_ctrl[4] = {0};
    dwm_read_reg(module, 0x0D, sys_ctrl, 4);
    sys_ctrl[0] |= (1 << 1); // TXSTRT
    dwm_write_reg(module, 0x0D, sys_ctrl, 4);


//    uint8_t sys_event_status_reg[5] = {0};
//
//    osDelay(3);
//
//    dwm_read_reg(module, 0x0f, sys_event_status_reg, 5);
//
//    if(!(sys_event_status_reg[0]&0x80)){
//    	return 0;
//    }
//
//    uint8_t clear[5] = {0};
//    clear[0] = 0x80;  // TXFRS
//    clear[1] = 0xF0;  // clear RXFCE, RXRFTO, RXPTO etc
//    dwm_write_reg(module, 0x0F, clear, 5);
//
//    return 1; // success


    uint8_t sys_status[5];
    int timeout = 10000;

    while(timeout--)
    {
        dwm_read_reg(module, 0x0F, sys_status, 5);
        if(sys_status[0] & 0x80)  // TXFRS
            break;
    }

    if(!(sys_status[0] & 0x80))
        return 0;   // timeout

    uint8_t clear[5] = {0};
    clear[0] = 0x80;
    dwm_write_reg(module, 0x0F, clear, 5);



    return 1;
}


bool process_response(uint8_t *rx_buffer, uint16_t len, uint64_t *treply_out)
{
    if (len < 6)
        return false;

    //Check message type
    if (rx_buffer[0] != MSG_TYPE_RESPONSE)
        return false;

    //Reconstruct 40-bit little-endian timestamp
    uint64_t treply = 0;

    for (int i = 0; i < 5; i++)
    {
        treply |= ((uint64_t)rx_buffer[1 + i]) << (8 * i);
    }

    *treply_out = treply;

    return true;
}


bool process_response_2(uint8_t *rx_buffer, uint16_t len, uint64_t *treply_out)
{
    if (len < 6)
        return false;

    //Check message type
    if (rx_buffer[0] != MSG_TYPE_FINAL)
        return false;

    //Reconstruct 40-bit little-endian timestamp
    uint64_t treply = 0;

    for (int i = 0; i < 5; i++)
    {
        treply |= ((uint64_t)rx_buffer[1 + i]) << (8 * i);
    }

    *treply_out = treply;

    return true;
}





bool robot_ranging_step(DWM_Module* module, uint64_t* distance_cm_out)
{
    static uint64_t t_tx_poll = 0;
    static uint64_t t_rx_resp = 0;
    static uint64_t t_reply_1 = 0;

    static uint64_t t_tx_poll_2 = 0;
    static uint64_t t_rx_resp_2 = 0;
    static uint64_t t_reply_2 = 0;


    uint8_t rx_buff[6];

    switch(robot_state)
    {
        //*******************************************
        case RSTATE_SEND_POLL:
        {
            // Try sending poll frame
            uint8_t poll_frame[6] = {MSG_TYPE_POLL, 0,0,0,0,0};

            if (!send_frame(module, poll_frame, 6)) {
                // send failed; retry a few times
                robot_state = RSTATE_ERROR_RECOVERY;
                return false;
            }

            // Save TX timestamp immediately
            t_tx_poll = read_timestamp(module, 0x17);

            // enable receiver
            uint8_t sys_ctrl_reg[4] = {0};
            sys_ctrl_reg[1] |= (1 << 0); // RXENAB
            dwm_write_reg(module, 0x0D, sys_ctrl_reg, 4);

            // Go to receiving state
            robot_state = RSTATE_WAIT_RESPONSE_1;


            break;
        }


